redisTestResult/redisMutiThreadsTestResult/redis_test_result_by_memtier_benchmark_FM_OFF_2nd/redis_result_Random110_FM_OFF_P2_2nd_20230717174423.log
20        Threads
5         Connections per thread
40        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        22406.68          ---          ---         4.05479         3.74300         7.83900        10.17500     24616.72 
Gets         2239.37      2239.37         0.00         4.03495         3.72700         7.80700        10.11100      2449.31 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      24646.05      2239.37         0.00         4.05299         3.74300         7.83900        10.17500     27066.02 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.087        0.000
SET       3.295        5.000
SET       3.375       10.000
SET       3.439       15.000
SET       3.471       20.000
SET       3.519       25.000
SET       3.567       30.000
SET       3.615       35.000
SET       3.647       40.000
SET       3.695       45.000
SET       3.743       50.000
SET       3.775       52.500
SET       3.791       55.000
SET       3.823       57.500
SET       3.855       60.000
SET       3.887       62.500
SET       3.919       65.000
SET       3.951       67.500
SET       3.983       70.000
SET       4.031       72.500
SET       4.063       75.000
SET       4.079       76.250
SET       4.127       77.500
SET       4.127       78.750
SET       4.159       80.000
SET       4.191       81.250
SET       4.223       82.500
SET       4.287       83.750
SET       4.351       85.000
SET       4.447       86.250
SET       4.575       87.500
SET       4.671       88.125
SET       4.799       88.750
SET       4.927       89.375
SET       5.055       90.000
SET       5.183       90.625
SET       5.279       91.250
SET       5.375       91.875
SET       5.471       92.500
SET       5.567       93.125
SET       5.663       93.750
SET       5.727       94.062
SET       5.759       94.375
SET       5.823       94.688
SET       5.919       95.000
SET       5.983       95.312
SET       6.079       95.625
SET       6.207       95.938
SET       6.367       96.250
SET       6.623       96.562
SET       6.783       96.875
SET       6.847       97.031
SET       6.911       97.188
SET       6.975       97.344
SET       7.039       97.500
SET       7.103       97.656
SET       7.167       97.812
SET       7.231       97.969
SET       7.327       98.125
SET       7.391       98.281
SET       7.487       98.438
SET       7.519       98.516
SET       7.551       98.594
SET       7.583       98.672
SET       7.647       98.750
SET       7.711       98.828
SET       7.775       98.906
SET       7.839       98.984
SET       7.871       99.062
SET       7.935       99.141
SET       7.999       99.219
SET       8.031       99.258
SET       8.063       99.297
SET       8.095       99.336
SET       8.127       99.375
SET       8.159       99.414
SET       8.191       99.453
SET       8.255       99.492
SET       8.319       99.531
SET       8.383       99.570
SET       8.447       99.609
SET       8.447       99.629
SET       8.511       99.648
SET       8.575       99.668
SET       8.639       99.688
SET       8.703       99.707
SET       8.767       99.727
SET       8.831       99.746
SET       8.959       99.766
SET       9.087       99.785
SET       9.215       99.805
SET       9.279       99.814
SET       9.407       99.824
SET       9.471       99.834
SET       9.599       99.844
SET       9.663       99.854
SET       9.727       99.863
SET       9.855       99.873
SET       9.983       99.883
SET      10.111       99.893
SET      10.239       99.902
SET      10.303       99.907
SET      10.367       99.912
SET      10.431       99.917
SET      10.495       99.922
SET      10.559       99.927
SET      10.623       99.932
SET      10.687       99.937
SET      10.751       99.941
SET      10.879       99.946
SET      11.007       99.951
SET      11.071       99.954
SET      11.135       99.956
SET      11.199       99.958
SET      11.327       99.961
SET      11.391       99.963
SET      11.391       99.966
SET      11.519       99.968
SET      11.647       99.971
SET      11.775       99.973
SET      11.839       99.976
SET      11.903       99.977
SET      11.903       99.978
SET      11.903       99.979
SET      11.967       99.980
SET      12.031       99.982
SET      12.095       99.983
SET      12.159       99.984
SET      12.223       99.985
SET      12.287       99.987
SET      12.415       99.988
SET      12.543       99.988
SET      13.055       99.989
SET      13.631       99.990
SET     614.399       99.990
SET     614.399       99.991
SET     614.399       99.991
SET     614.399       99.992
SET     614.399       99.993
SET     614.399       99.993
SET     614.399       99.994
SET     614.399       99.994
SET     614.399       99.995
SET     614.399       99.995
SET     614.399       99.995
[...]
SET     614.399       99.996
SET     614.399       99.996
SET     614.399       99.996
SET     614.399       99.997
SET     614.399       99.997
SET     614.399       99.997
[...]
SET     614.399       99.998
SET     614.399       99.998
SET     614.399       99.998
[...]
SET     614.399       99.999
SET     614.399       99.999
SET     614.399       99.999
[...]
SET     618.495       99.999
SET     618.495      100.000
SET     618.495      100.000
SET     618.495      100.000
[...]
SET     622.591      100.000
SET     622.591      100.000
---
GET       0.111        0.000
GET       3.295        5.000
GET       3.375       10.000
GET       3.423       15.000
GET       3.471       20.000
GET       3.519       25.000
GET       3.551       30.000
GET       3.599       35.000
GET       3.647       40.000
GET       3.695       45.000
GET       3.727       50.000
GET       3.759       52.500
GET       3.791       55.000
GET       3.807       57.500
GET       3.839       60.000
GET       3.871       62.500
GET       3.903       65.000
GET       3.935       67.500
GET       3.967       70.000
GET       4.015       72.500
GET       4.047       75.000
GET       4.063       76.250
GET       4.095       77.500
GET       4.127       78.750
GET       4.159       80.000
GET       4.191       81.250
GET       4.223       82.500
GET       4.255       83.750
GET       4.319       85.000
GET       4.415       86.250
GET       4.543       87.500
GET       4.639       88.125
GET       4.735       88.750
GET       4.831       89.375
GET       4.959       90.000
GET       5.087       90.625
GET       5.183       91.250
GET       5.279       91.875
GET       5.375       92.500
GET       5.471       93.125
GET       5.567       93.750
GET       5.599       94.062
GET       5.663       94.375
GET       5.727       94.688
GET       5.791       95.000
GET       5.855       95.312
GET       5.951       95.625
GET       6.111       95.938
GET       6.271       96.250
GET       6.527       96.562
GET       6.719       96.875
GET       6.783       97.031
GET       6.879       97.188
GET       6.943       97.344
GET       7.007       97.500
GET       7.071       97.656
GET       7.135       97.812
GET       7.199       97.969
GET       7.263       98.125
GET       7.359       98.281
GET       7.455       98.438
GET       7.487       98.516
GET       7.551       98.594
GET       7.583       98.672
GET       7.615       98.750
GET       7.679       98.828
GET       7.743       98.906
GET       7.807       98.984
GET       7.839       99.062
GET       7.903       99.141
GET       7.967       99.219
GET       7.999       99.258
GET       8.031       99.297
GET       8.063       99.336
GET       8.095       99.375
GET       8.127       99.414
GET       8.159       99.453
GET       8.191       99.492
GET       8.255       99.531
GET       8.319       99.570
GET       8.383       99.609
GET       8.447       99.629
GET       8.447       99.648
GET       8.511       99.668
GET       8.575       99.688
GET       8.639       99.707
GET       8.703       99.727
GET       8.831       99.746
GET       8.895       99.766
GET       8.959       99.785
GET       9.087       99.805
GET       9.087       99.814
GET       9.279       99.824
GET       9.343       99.834
GET       9.471       99.844
GET       9.535       99.854
GET       9.663       99.863
GET       9.727       99.873
GET       9.855       99.883
GET       9.983       99.893
GET      10.111       99.902
GET      10.175       99.907
GET      10.239       99.912
GET      10.303       99.917
GET      10.367       99.922
GET      10.495       99.927
GET      10.559       99.932
GET      10.623       99.937
GET      10.751       99.941
GET      10.815       99.946
GET      10.943       99.951
GET      11.007       99.954
GET      11.007       99.956
GET      11.071       99.958
GET      11.071       99.961
GET      11.199       99.963
GET      11.199       99.966
GET      11.263       99.968
GET      11.263       99.971
GET      11.455       99.973
GET      11.583       99.976
GET      11.583       99.977
GET      11.775       99.978
GET      11.903       99.979
GET      11.967       99.980
GET      12.031       99.982
GET      12.095       99.983
GET      12.159       99.984
GET      12.223       99.985
GET      12.287       99.987
GET      12.671       99.988
GET      12.671       99.988
GET      14.335       99.989
GET      14.335       99.990
GET     614.399       99.990
GET     614.399      100.000
---
WAIT      0.000      100.000